In [2]:
import sqlite3
import pandas as pd

In [4]:
# in memory db
conn = sqlite3.connect(":memory:")
cur = conn.cursor()

In [5]:
cur.execute("""
CREATE TABLE customers (id INTEGER PRIMARY KEY, name TEXT, age INTEGER, amount REAL)
""")

In [6]:
conn.commit()

In [7]:
cur.execute("""
INSERT INTO customers (name, age, amount)
VALUES ('Batman', 22, 1000)
""")
conn.commit()

In [ ]:
# insert multiple rows
# ? is used to prevent SQL injections, it acts as a placeholder

data = [
    ('Joker', 30, 300),
    ('Alfred', 75, 2000)
]

cur.executemany("""
INSERT INTO customers (name, age, amount) VALUES (?, ?, ?)
""", data)

conn.commit()

In [9]:
# query data

cur.execute("SELECT * from customers")
rows = cur.fetchall()

for row in rows:
    print(row)

(1, 'Batman', 22, 1000.0)
(2, 'Joker', 30, 300.0)
(3, 'Alfred', 75, 2000.0)

In [11]:
# filtering

cur.execute("SELECT name, amount FROM customers WHERE  amount > 300")
print(cur.fetchall())

[('Batman', 1000.0), ('Alfred', 2000.0)]

In [13]:
# pandas and sql interaction

df = pd.read_sql("SELECT * FROM customers", conn)
df

   id    name  age  amount
0   1  Batman   22  1000.0
1   2   Joker   30   300.0
2   3  Alfred   75  2000.0

In [14]:
conn.close()